wolaite2024/jlab-jh5003-dongle/inc/rtl87x3ep/io/rtl_can_def.h
/**
*****************************************************************************************
*     Copyright(c) 2023, Realtek Semiconductor Corporation. All rights reserved.
*****************************************************************************************
* \file    rtl_can_def.h
* \brief   CAN related definitions for RTL87x3e.
* \author
* \date    2023-11-16
* \version v1.0
* *************************************************************************************
*/

#ifndef RTL_CAN_DEF_H
#define RTL_CAN_DEF_H

#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/* ================================================================================ */
/* ================          CAN Registers_Structures        ================ */
/* ================================================================================ */
/**
  * @brief Analog to digital converter. (CAN)
  */
typedef struct            /*!< CAN Structure */
{
    __IO uint32_t  CAN_CTL;              //!<0X00
    __IO uint32_t  CAN_STS;              //!<0X04
    __IO uint32_t  CAN_FIFO_STS;         //!<0X08
    __IO uint32_t  CAN_BIT_TIMING;       //!<0X0C
    __IO uint32_t  CAN_FD_BIT_TIMING;    //!<0X10
    __IO uint32_t  CAN_FD_SSP_CAL;       //!<0X14
    __IO uint32_t  CAN_INT_EN;           //!<0X18
    __IO uint32_t  CAN_MB_RXINT_EN;      //!<0X1C
    __IO uint32_t  CAN_MB_TXINT_EN;      //!<0X20
    __IO uint32_t  CAN_INT_FLAG;         //!<0X24
    __IO uint32_t  CAN_ERR_STATUS;       //!<0X28
    __IO uint32_t  CAN_ERR_CNT_CTL;      //!<0X2C
    __IO uint32_t  CAN_ERR_CNT_STS;      //!<0X30
    __IO uint32_t  CAN_TX_ERROR_FLAG;    //!<0X34
    __IO uint32_t  CAN_TX_DONE;          //!<0X38
    __IO uint32_t  CAN_RX_DONE;          //!<0X3C
    __IO uint32_t  CAN_TIME_STAMP;       //!<0X40
    __IO uint32_t  CAN_MB_TRIGGER;       //!<0X44
    __IO uint32_t  CAN_RXDMA_MSIZE;      //!<0X48
    __IO uint32_t  CAN_RX_DMA_DATA;      //!<0X4C
    __IO uint32_t  CAN_SLEEP_MODE;       //!<0X50
    __IO uint32_t  CAN_TEST;             //!<0X54
    __IO uint32_t  CAN_MB0_15_STS;       //!<0X100:0x13C
    __IO uint32_t  CAN_MB0_15_CTRL;      //!<0X200:0x23C
    __IO uint32_t  CAN_MB_BA_END;        //!<0X2F0
    __IO uint32_t  CAN_RAM_DATA15_0;     //!<0X300:0x33C
    __IO uint32_t  CAN_RAM_ARB;          //!<0X340
    __IO uint32_t  CAN_RAM_MASK;         //!<0X344
    __IO uint32_t  CAN_RAM_CS;           //!<0X348
    __IO uint32_t  CAN_RAM_CMD;          //!<0X34C
} CAN_TypeDef;

/* ================================================================================ */
/* ================          CAN Register           ================ */
/* ================================================================================ */
/**
  * @brief Analog to digital converter. (CAN)
  */
/* 0x000        CAN_CTL
    0       R/W    can_en                  0x0
    1       R/W/ES bus_on_req              0x0
    2       R/W    can_tri_sample          0x0
    3       R/W    auto_re_tx_en           0x0
    4       R/W    test_mode_en            0x0
    5       R/W    rx_fifo_en              0x0
    6       R/W    can_fd_en               0x0
    7       R/W    can_rxdma_en            0x0
    8       R/W    can_fd_crc_mode         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_en: 1;
        __IO uint32_t bus_on_req: 1;
        __IO uint32_t can_tri_sample: 1;
        __IO uint32_t auto_re_tx_en: 1;
        __IO uint32_t test_mode_en: 1;
        __IO uint32_t rx_fifo_en: 1;
        __IO uint32_t can_fd_en: 1;
        __IO uint32_t can_rxdma_en: 1;
        __IO uint32_t can_fd_crc_mode: 1;
    } b;
} CAN_0x00_TYPE_TypeDef;

/* 0x004        CAN_STS
    0       R      bus_on_state            0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t bus_on_state: 1;
    } b;
} CAN_0x04_TYPE_TypeDef;

/* 0x008        CAN_FIFO_STS
    0       R      fifo_msg_full           0x0
    1       R      fifo_msg_empty          0x0
    2       R      fifo_msg_overflow       0x0
    6:4     R      fifo_msg_lvl            0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t fifo_msg_full: 1;
        __I uint32_t fifo_msg_empty: 1;
        __I uint32_t fifo_msg_overflow: 1;
        __I uint32_t RESERVED_0:  1;
        __I uint32_t fifo_msg_lvl: 3;
    } b;
} CAN_0x08_TYPE_TypeDef;

/* 0x00C        CAN_BIT_TIMING
    7:0     R/W    can_tseg1               0x0
    15:8    R/W    can_tseg2               0x0
    18:16   R/W    can_sjw                 0x0
    31:24   R/W    can_brp                 0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_tseg1: 8;
        __IO uint32_t can_tseg2: 8;
        __IO uint32_t can_sjw: 3;
        __IO uint32_t RESERVED_0:  5;
        __IO uint32_t can_brp: 8;
    } b;
} CAN_0x0C_TYPE_TypeDef;

/* 0x010        CAN_FD_BIT_TIMING
    7:0     R/W    can_fd_tseg1            0x0
    15:8    R/W    can_fd_tseg2            0x0
    18:16   R/W    can_fd_sjw              0x0
    31:24   R/W    can_fd_brp              0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_fd_tseg1: 8;
        __IO uint32_t can_fd_tseg2: 8;
        __IO uint32_t can_fd_sjw: 3;
        __IO uint32_t RESERVED_0:  5;
        __IO uint32_t can_fd_brp: 8;
    } b;
} CAN_0x10_TYPE_TypeDef;

/* 0x014        CAN_FD_SSP_CAL
    7:0     R/W/ES can_fd_ssp              0x0
    15:8    R/W    can_fd_ssp_min          0x0
    23:16   R/W    can_fd_ssp_dco          0x0
    24      R/W    can_fd_ssp_auto         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_fd_ssp: 8;
        __IO uint32_t can_fd_ssp_min: 8;
        __IO uint32_t can_fd_ssp_dco: 8;
        __IO uint32_t can_fd_ssp_auto: 1;
    } b;
} CAN_0x14_TYPE_TypeDef;

/* 0x018        CAN_INT_EN
    0       R/W    tx_int_en               0x0
    1       R/W    rx_int_en               0x0
    2       R/W    error_int_en            0x0
    3       R/W    wakeup_int_en           0x0
    4       R/W    busoff_int_en           0x0
    5       R/W    ram_move_done_int_en    0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t tx_int_en: 1;
        __IO uint32_t rx_int_en: 1;
        __IO uint32_t error_int_en: 1;
        __IO uint32_t wakeup_int_en: 1;
        __IO uint32_t busoff_int_en: 1;
        __IO uint32_t ram_move_done_int_en: 1;
    } b;
} CAN_0x18_TYPE_TypeDef;

