wolaite2024/jlab-jh5003-dongle/inc/rtl87x3ep/io/rtl_can_def.h
/* 0x01C        CAN_MB_RXINT_EN
    15:0    R/W    can_mb_rxint_en         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_mb_rxint_en: 16;
    } b;
} CAN_0x1C_TYPE_TypeDef;

/* 0x020        CAN_MB_TXINT_EN
    15:0    R/W    can_mb_txint_en         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_mb_txint_en: 16;
    } b;
} CAN_0x20_TYPE_TypeDef;

/* 0x024        CAN_INT_FLAG
    0       RW1C   tx_int_flag             0x0
    1       RW1C   rx_int_flag             0x0
    2       RW1C   error_int_flag          0x0
    3       RW1C   wakeup_int_flag         0x0
    4       RW1C   busoff_int_flag         0x0
    5       RW1C   ram_move_done_int_flag  0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t tx_int_flag: 1;
        __IO uint32_t rx_int_flag: 1;
        __IO uint32_t error_int_flag: 1;
        __IO uint32_t wakeup_int_flag: 1;
        __IO uint32_t busoff_int_flag: 1;
        __IO uint32_t ram_move_done_int_flag: 1;
    } b;
} CAN_0x24_TYPE_TypeDef;

/* 0x028        CAN_ERR_STATUS
    0       RW1C   can_error_bit0          0x0
    1       RW1C   can_error_bit1          0x0
    2       RW1C   can_error_form          0x0
    3       RW1C   can_error_crc           0x0
    4       RW1C   can_error_stuff         0x0
    5       RW1C   can_error_ack           0x0
    8       RW1C   can_error_tx            0x0
    9       RW1C   can_error_rx            0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_error_bit0: 1;
        __IO uint32_t can_error_bit1: 1;
        __IO uint32_t can_error_form: 1;
        __IO uint32_t can_error_crc: 1;
        __IO uint32_t can_error_stuff: 1;
        __IO uint32_t can_error_ack: 1;
        __IO uint32_t RESERVED_0:  2;
        __IO uint32_t can_error_tx: 1;
        __IO uint32_t can_error_rx: 1;
    } b;
} CAN_0x28_TYPE_TypeDef;

/* 0x02C        CAN_ERR_CNT_CTL
    0       WA0    tx_err_cnt_clr          0x0
    1       WA0    rx_err_cnt_clr          0x0
    16:8    R/W    can_error_warn_th       0x60
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t tx_err_cnt_clr: 1;
        __IO uint32_t rx_err_cnt_clr: 1;
        __IO uint32_t RESERVED_0:  6;
        __IO uint32_t can_error_warn_th: 9;
    } b;
} CAN_0x2C_TYPE_TypeDef;

/* 0x030        CAN_ERR_CNT_STS
    8:0     R      can_tec                 0x0
    24:16   R      can_rec                 0x0
    28      R      can_error_passive       0x0
    29      R      can_error_busoff        0x0
    30      R      can_error_warning       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t can_tec: 9;
        __I uint32_t RESERVED_1:  7;
        __I uint32_t can_rec: 9;
        __I uint32_t RESERVED_0:  3;
        __I uint32_t can_error_passive: 1;
        __I uint32_t can_error_busoff: 1;
        __I uint32_t can_error_warning: 1;
    } b;
} CAN_0x30_TYPE_TypeDef;

/* 0x034        CAN_TX_ERROR_FLAG
    15:0    RW1CB  can_tx_error_flag       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_tx_error_flag: 16;
    } b;
} CAN_0x34_TYPE_TypeDef;

/* 0x038        CAN_TX_DONE
    15:0    RW1CB  can_tx_done             0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_tx_done: 16;
    } b;
} CAN_0x38_TYPE_TypeDef;

/* 0x03C        CAN_RX_DONE
    15:0    RW1CB  can_rx_done             0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_rx_done: 16;
    } b;
} CAN_0x3C_TYPE_TypeDef;

/* 0x040        CAN_TIME_STAMP
    15:0    R      can_time_stamp          0x0
    23:16   R/W    can_time_stamp_div      0x0
    31      R/W    can_time_stamp_en       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t can_time_stamp: 16;
        __IO uint32_t can_time_stamp_div: 8;
        __IO uint32_t RESERVED_0:  7;
        __IO uint32_t can_time_stamp_en: 1;
    } b;
} CAN_0x40_TYPE_TypeDef;

/* 0x044        CAN_MB_TRIGGER
    15:0    R/W    tx_trigger_begin        0x0
    23:16   R/W    tx_trigger_close_offset 0x0
    24      R/W    tx_trigger_en           0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t tx_trigger_begin: 16;
        __IO uint32_t tx_trigger_close_offset: 8;
        __IO uint32_t tx_trigger_en: 1;
    } b;
} CAN_0x44_TYPE_TypeDef;

/* 0x048        CAN_RXDMA_MSIZE
    13:0    R      can_rxdma_msize         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t can_rxdma_msize: 14;
    } b;
} CAN_0x48_TYPE_TypeDef;

/* 0x04C        CAN_RX_DMA_DATA
    31:0    RP     can_rx_dma_data         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_rx_dma_data: 32;
    } b;
} CAN_0x4C_TYPE_TypeDef;

/* 0x050        CAN_SLEEP_MODE
    7:0     R/W    can_wakepin_flt_length  0x0
    8       R/W    can_wakepin_flt_en      0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_wakepin_flt_length: 8;
        __IO uint32_t can_wakepin_flt_en: 1;
    } b;
} CAN_0x50_TYPE_TypeDef;

/* 0x054        CAN_TEST
    0       R/W    can_lpb_en              0x0
    1       R/W    can_silence_en          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_lpb_en: 1;
        __IO uint32_t can_silence_en: 1;
    } b;
} CAN_0x54_TYPE_TypeDef;

/* 0x100:0x13C        CAN_MB0_STS:CAN_MB15_STS
    0       R      can_msg_tx_req         0x0
    1       R      can_msg_tx_done        0x0
    2       R      can_msg_rx_rdy         0x0
    3       R      can_msg_rx_vld         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __I uint32_t can_msg_tx_req: 1;
        __I uint32_t can_msg_tx_done: 1;
        __I uint32_t can_msg_rx_rdy: 1;
        __I uint32_t can_msg_rx_vld: 1;
    } b;
} CAN_0x100_0x13C_TYPE_TypeDef;

