wolaite2024/jlab-jh5003-dongle/inc/rtl87x3ep/io/rtl_can_def.h
/* 0x200:0x23C        CAN_MB0_CTRL:CAN_MB15_CTRL
    8:0     R/W    can_msg@_ba             0x0
    24      R/W/ES can_msg@_rxdma_en       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_msg_ba: 9;
        __IO uint32_t RESERVED_0:  15;
        __IO uint32_t can_msg_rxdma_en: 1;
    } b;
} CAN_0x200_0x23C_TYPE_TypeDef;

/* 0x300:0x33C        CAN_RAM_FDDATA_15:CAN_RAM_DATA_0
    7:0     R/W/ES can_ram_data0          0x0
    15:8    R/W/ES can_ram_data1          0x0
    23:16   R/W/ES can_ram_data2          0x0
    31:24   R/W/ES can_ram_data3          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_ram_data0: 8;
        __IO uint32_t can_ram_data1: 8;
        __IO uint32_t can_ram_data2: 8;
        __IO uint32_t can_ram_data3: 8;
    } b;
} CAN_0x300_0x33C_TYPE_TypeDef;

/* 0x340        CAN_RAM_ARB
    28:0    R/W/ES can_ram_id              0x0
    29      R/W/ES can_ram_ide             0x0
    30      R/W/ES can_ram_rtr             0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_ram_id: 29;
        __IO uint32_t can_ram_ide: 1;
        __IO uint32_t can_ram_rtr: 1;
    } b;
} CAN_0x340_TYPE_TypeDef;

/* 0x344        CAN_RAM_MASK
    28:0    R/W/ES can_ram_id_mask         0x0
    29      R/W/ES can_ram_ide_mask        0x0
    30      R/W/ES can_ram_rtr_mask        0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_ram_id_mask: 29;
        __IO uint32_t can_ram_ide_mask: 1;
        __IO uint32_t can_ram_rtr_mask: 1;
    } b;
} CAN_0x344_TYPE_TypeDef;

/* 0x348        CAN_RAM_CS
    3:0     R/W/ES can_ram_dlc             0x0
    4       R/W/ES can_ram_lost            0x0
    5       R/W/ES can_ram_rxtx            0x0
    6       R/W/ES can_ram_autoreply       0x0
    8       R/W/ES can_ram_edl             0x0
    9       R/W/ES can_ram_brs             0x0
    10      R/W/ES can_ram_esi             0x0
    31:16   R/W/ES can_ram_timestamp       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_ram_dlc: 4;
        __IO uint32_t can_ram_lost: 1;
        __IO uint32_t can_ram_rxtx: 1;
        __IO uint32_t can_ram_autoreply: 1;
        __IO uint32_t RESERVED_1:  1;
        __IO uint32_t can_ram_edl: 1;
        __IO uint32_t can_ram_brs: 1;
        __IO uint32_t can_ram_esi: 1;
        __IO uint32_t RESERVED_0:  5;
        __IO uint32_t can_ram_timestamp: 16;
    } b;
} CAN_0x348_TYPE_TypeDef;

/* 0x34C        CAN_RAM_CMD
    7:0     R/W    can_ram_acc_num         0x0
    8       R/W    can_ram_acc_mask        0x0
    9       R/W    can_ram_acc_cs          0x0
    10      R/W    can_ram_acc_arb         0x0
    11:26   R/W    can_ram_acc_data       0x0
    29      R/W    can_ram_buffer_en       0x0
    30      R/W    can_ram_dir             0x0
    31      R/W/ES can_ram_start           0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t can_ram_acc_num: 8;
        __IO uint32_t can_ram_acc_mask: 1;
        __IO uint32_t can_ram_acc_cs: 1;
        __IO uint32_t can_ram_acc_arb: 1;
        __IO uint32_t can_ram_acc_data: 16;
        __IO uint32_t RESERVED_0:  2;
        __IO uint32_t can_ram_buffer_en: 1;
        __IO uint32_t can_ram_dir: 1;
        __IO uint32_t can_ram_start: 1;
    } b;
} CAN_0x34C_TYPE_TypeDef;


typedef struct
{
    union
    {
        __IO uint32_t CAN_CTL;
        CAN_0x00_TYPE_TypeDef BITS_00;
    } u_00;

    union
    {
        __IO uint32_t CAN_STS;
        CAN_0x04_TYPE_TypeDef BITS_04;
    } u_04;

    union
    {
        __IO uint32_t CAN_FIFO_STS;
        CAN_0x08_TYPE_TypeDef BITS_08;
    } u_08;

    union
    {
        __IO uint32_t CAN_BIT_TIMING;
        CAN_0x0C_TYPE_TypeDef BITS_0C;
    } u_0C;

    union
    {
        __IO uint32_t CAN_FD_BIT_TIMING;
        CAN_0x10_TYPE_TypeDef BITS_10;
    } u_10;

    union
    {
        __IO uint32_t CAN_FD_SSP_CAL;
        CAN_0x14_TYPE_TypeDef BITS_14;
    } u_14;

    union
    {
        __IO uint32_t CAN_INT_EN;
        CAN_0x18_TYPE_TypeDef BITS_18;
    } u_18;

    union
    {
        __IO uint32_t CAN_MB_RXINT_EN;
        CAN_0x1C_TYPE_TypeDef BITS_1C;
    } u_1C;

    union
    {
        __IO uint32_t CAN_MB_TXINT_EN;
        CAN_0x20_TYPE_TypeDef BITS_20;
    } u_20;

    union
    {
        __IO uint32_t CAN_INT_FLAG;
        CAN_0x24_TYPE_TypeDef BITS_24;
    } u_24;

    union
    {
        __IO uint32_t CAN_ERR_STATUS;
        CAN_0x28_TYPE_TypeDef BITS_28;
    } u_28;

    union
    {
        __IO uint32_t CAN_ERR_CNT_CTL;
        CAN_0x2C_TYPE_TypeDef BITS_2C;
    } u_2C;

    union
    {
        __IO uint32_t CAN_ERR_CNT_STS;
        CAN_0x30_TYPE_TypeDef BITS_30;
    } u_30;

    union
    {
        __IO uint32_t CAN_TX_ERROR_FLAG;
        CAN_0x34_TYPE_TypeDef BITS_34;
    } u_34;

    union
    {
        __IO uint32_t CAN_TX_DONE;
        CAN_0x38_TYPE_TypeDef BITS_38;
    } u_38;

    union
    {
        __IO uint32_t CAN_RX_DONE;
        CAN_0x3C_TYPE_TypeDef BITS_3C;
    } u_3C;

    union
    {
        __IO uint32_t CAN_TIME_STAMP;
        CAN_0x40_TYPE_TypeDef BITS_40;
    } u_40;

    union
    {
        __IO uint32_t CAN_MB_TRIGGER;
        CAN_0x44_TYPE_TypeDef BITS_44;
    } u_44;

    union
    {
        __IO uint32_t CAN_RXDMA_MSIZE;
        CAN_0x48_TYPE_TypeDef BITS_48;
    } u_48;

    union
    {
        __IO uint32_t CAN_RX_DMA_DATA;
        CAN_0x4C_TYPE_TypeDef BITS_4C;
    } u_4C;

    union
    {
        __IO uint32_t CAN_SLEEP_MODE;
        CAN_0x50_TYPE_TypeDef BITS_50;
    } u_50;

    union
    {
        __IO uint32_t CAN_TEST;
        CAN_0x54_TYPE_TypeDef BITS_54;
    } u_54;
} CAN_BASE_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CAN_MB0_STS;
        CAN_0x100_0x13C_TYPE_TypeDef u_100;
    } u_100;

    union
    {
        __IO uint32_t CAN_MB1_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_104;
    } u_104;

    union
    {
        __IO uint32_t CAN_MB2_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_108;
    } u_108;

    union
    {
        __IO uint32_t CAN_MB3_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_10C;
    } u_10C;

    union
    {
        __IO uint32_t CAN_MB4_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_110;
    } u_110;

    union
    {
        __IO uint32_t CAN_MB5_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_114;
    } u_114;

    union
    {
        __IO uint32_t CAN_MB6_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_118;
    } u_118;

    union
    {
        __IO uint32_t CAN_MB7_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_11C;
    } u_11C;

    union
    {
        __IO uint32_t CAN_MB8_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_120;
    } u_120;

    union
    {
        __IO uint32_t CAN_MB9_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_124;
    } u_124;

    union
    {
        __IO uint32_t CAN_MB10_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_128;
    } u_128;

    union
    {
        __IO uint32_t CAN_MB11_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_12C;
    } u_12C;

    union
    {
        __IO uint32_t CAN_MB12_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_130;
    } u_130;

    union
    {
        __IO uint32_t CAN_MB13_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_134;
    } u_134;

    union
    {
        __IO uint32_t CAN_MB14_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_138;
    } u_138;

    union
    {
        __IO uint32_t CAN_MB15_STS;
        CAN_0x100_0x13C_TYPE_TypeDef BITS_13C;
    } u_13C;
} CAN_MB_STS_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CAN_MB0_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_200;
    } u_200;

    union
    {
        __IO uint32_t CAN_MB1_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_204;
    } u_204;

    union
    {
        __IO uint32_t CAN_MB2_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_208;
    } u_208;

    union
    {
        __IO uint32_t CAN_MB3_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_20C;
    } u_20C;

    union
    {
        __IO uint32_t CAN_MB4_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_210;
    } u_210;

    union
    {
        __IO uint32_t CAN_MB5_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_214;
    } u_214;

    union
    {
        __IO uint32_t CAN_MB6_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_218;
    } u_218;

    union
    {
        __IO uint32_t CAN_MB7_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_21C;
    } u_21C;

    union
    {
        __IO uint32_t CAN_MB8_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_220;
    } u_220;

    union
    {
        __IO uint32_t CAN_MB9_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_224;
    } u_224;

    union
    {
        __IO uint32_t CAN_MB10_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_228;
    } u_228;

    union
    {
        __IO uint32_t CAN_MB11_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_22C;
    } u_22C;

    union
    {
        __IO uint32_t CAN_MB12_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_230;
    } u_230;

    union
    {
        __IO uint32_t CAN_MB13_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_234;
    } u_234;

    union
    {
        __IO uint32_t CAN_MB14_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_238;
    } u_238;

    union
    {
        __IO uint32_t CAN_MB15_CTRL;
        CAN_0x200_0x23C_TYPE_TypeDef BITS_23C;
    } u_23C;
} CAN_MB_CTRL_TypeDef;

typedef struct
{
    __IO uint32_t CAN_RAM_DATA[16];

    union
    {
        __IO uint32_t CAN_RAM_ARB;
        CAN_0x340_TYPE_TypeDef BITS_340;
    } u_340;

    union
    {
        __IO uint32_t CAN_RAM_MASK;
        CAN_0x344_TYPE_TypeDef BITS_344;
    } u_344;

    union
    {
        __IO uint32_t CAN_RAM_CS;
        CAN_0x348_TYPE_TypeDef BITS_348;
    } u_348;

    union
    {
        __IO uint32_t CAN_RAM_CMD;
        CAN_0x34C_TYPE_TypeDef BITS_34C;
    } u_34C;
} CAN_RAM_TypeDef;

