wolaite2024/jlab-jh5003-dongle/inc/rtl87x3ep/io/rtl_can_def.h
/* CAN reg */
/*
    because CAN register must access by word
    in order to prevent misoperating,
    we use the similar write approach as fast aon registers
*/
#define CAN_REG_00                0x000
#define CAN_REG_04                0x004
#define CAN_REG_08                0x008
#define CAN_REG_0C                0x00C
#define CAN_REG_10                0x010
#define CAN_REG_14                0x014
#define CAN_REG_18                0x018
#define CAN_REG_20                0x020
#define CAN_REG_24                0x024
#define CAN_REG_28                0x028
#define CAN_REG_2C                0x02C
#define CAN_REG_30                0x030
#define CAN_REG_34                0x034
#define CAN_REG_38                0x038
#define CAN_REG_3C                0x03C
#define CAN_REG_40                0x040
#define CAN_REG_44                0x044
#define CAN_REG_48                0x048
#define CAN_REG_4C                0x04C
#define CAN_REG_50                0x050
#define CAN_REG_54                0x054
#define CAN_REG_100               0x100
#define CAN_REG_200               0x200
#define CAN_REG_2F0               0x2F0
#define CAN_REG_300               0x300
#define CAN_REG_33C               0x33C
#define CAN_REG_340               0x340
#define CAN_REG_344               0x344
#define CAN_REG_348               0x348
#define CAN_REG_34C               0x34C
#define CAN_REG_3FC               0x3FC


#define CAN                       ((CAN_BASE_TypeDef        *) CAN_BASE)
#define CAN_RAM                   ((CAN_RAM_TypeDef     *) (CAN_BASE + CAN_REG_300))

#define CAN_RX_DMA_DATA           (CAN_BASE + CAN_REG_4C)
#define CAN_MB_STS                (CAN_BASE + CAN_REG_100)
#define CAN_MB_CTRL               (CAN_BASE + CAN_REG_200)
#define CAN_MB_BA_END             (CAN_BASE + CAN_REG_2F0)
#define CAN_RAM_DATA0             (CAN_BASE + CAN_REG_33C)

#define can_reg_read32(offset)           HAL_READ32(CAN_BASE, offset)
#define can_reg_write32(offset, value)   HAL_WRITE32(CAN_BASE, offset, value)

#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL_CAN_DEF_H */

